{
  "attributes": {
    "description": "UniFi Network Console Overview - WAN stats, throughput, device health, and syslog events",
    "kibanaSavedObjectMeta": {
      "searchSourceJSON": "{\"filter\": [{\"meta\": {\"alias\": null, \"disabled\": false, \"key\": \"service.name\", \"negate\": false, \"params\": {\"query\": \"unifi\"}, \"type\": \"phrase\"}, \"query\": {\"match_phrase\": {\"service.name\": \"unifi\"}}}]}"
    },
    "optionsJSON": "{\"hidePanelTitles\":false,\"hidePanelBorders\":false,\"useMargins\":true,\"autoApplyFilters\":true,\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false}",
    "panelsJSON": "[{\"type\": \"markdown\", \"embeddableConfig\": {\"content\": \"## UniFi Overview\\n[Topology](/app/dashboards#/view/unifi-topology-dashboard)  |  [Devices](/app/dashboards#/view/unifi-devices-dashboard)  |  [Clients](/app/dashboards#/view/unifi-clients-dashboard)  |  [Insights](/app/dashboards#/view/unifi-insights-dashboard)\"}, \"panelIndex\": \"504bc880-9eb2-4b93-b85b-73d14262440f\", \"gridData\": {\"x\": 0, \"y\": 0, \"w\": 48, \"h\": 3, \"i\": \"504bc880-9eb2-4b93-b85b-73d14262440f\"}}, {\"type\": \"lens\", \"embeddableConfig\": {\"attributes\": {\"visualizationType\": \"lnsMetric\", \"title\": \"WAN Download\", \"references\": [], \"state\": {\"datasourceStates\": {\"textBased\": {\"layers\": {\"layer_0\": {\"index\": \"metrics-unifi.device-default-73ae30ee293c109d2e4d752685ea3a39add387ee8e7a3b8581f0a712df243b12\", \"query\": {\"esql\": \"FROM metrics-unifi.device-default | WHERE observer.type == \\\"router\\\" | STATS `Down Mbps` = MAX(metrics.unifi.device.speedtest.down_mbps)\"}, \"columns\": [{\"columnId\": \"metric_accessor_metric\", \"fieldName\": \"Down Mbps\", \"meta\": {\"type\": \"number\"}}]}}}}, \"internalReferences\": [{\"type\": \"index-pattern\", \"id\": \"metrics-unifi.device-default-73ae30ee293c109d2e4d752685ea3a39add387ee8e7a3b8581f0a712df243b12\", \"name\": \"indexpattern-datasource-layer-layer_0\"}], \"visualization\": {\"layerId\": \"layer_0\", \"layerType\": \"data\", \"metricAccessor\": \"metric_accessor_metric\", \"subtitle\": \"\", \"showBar\": false, \"valueFontMode\": \"default\", \"primaryAlign\": \"right\", \"titlesTextAlign\": \"left\"}, \"adHocDataViews\": {\"metrics-unifi.device-default-73ae30ee293c109d2e4d752685ea3a39add387ee8e7a3b8581f0a712df243b12\": {\"id\": \"metrics-unifi.device-default-73ae30ee293c109d2e4d752685ea3a39add387ee8e7a3b8581f0a712df243b12\", \"title\": \"metrics-unifi.device-default\", \"name\": \"metrics-unifi.device-default\", \"sourceFilters\": [], \"fieldFormats\": {}, \"runtimeFieldMap\": {}, \"fieldAttrs\": {}, \"allowNoIndex\": false, \"allowHidden\": false, \"type\": \"esql\"}}, \"query\": {\"esql\": \"FROM metrics-unifi.device-default | WHERE observer.type == \\\"router\\\" | STATS `Down Mbps` = MAX(metrics.unifi.device.speedtest.down_mbps)\"}, \"filters\": []}}}, \"panelIndex\": \"07dafc99-0473-42ba-a40e-132a1a884829\", \"gridData\": {\"x\": 0, \"y\": 3, \"w\": 8, \"h\": 5, \"i\": \"07dafc99-0473-42ba-a40e-132a1a884829\"}}, {\"type\": \"lens\", \"embeddableConfig\": {\"attributes\": {\"visualizationType\": \"lnsMetric\", \"title\": \"WAN Upload\", \"references\": [], \"state\": {\"datasourceStates\": {\"textBased\": {\"layers\": {\"layer_0\": {\"index\": \"metrics-unifi.device-default-ab1efb56f13e258c4741330bf35b2066215bd265307cce933fa6f8589801c6a1\", \"query\": {\"esql\": \"FROM metrics-unifi.device-default | WHERE observer.type == \\\"router\\\" | STATS `Up Mbps` = MAX(metrics.unifi.device.speedtest.up_mbps)\"}, \"columns\": [{\"columnId\": \"metric_accessor_metric\", \"fieldName\": \"Up Mbps\", \"meta\": {\"type\": \"number\"}}]}}}}, \"internalReferences\": [{\"type\": \"index-pattern\", \"id\": \"metrics-unifi.device-default-ab1efb56f13e258c4741330bf35b2066215bd265307cce933fa6f8589801c6a1\", \"name\": \"indexpattern-datasource-layer-layer_0\"}], \"visualization\": {\"layerId\": \"layer_0\", \"layerType\": \"data\", \"metricAccessor\": \"metric_accessor_metric\", \"subtitle\": \"\", \"showBar\": false, \"valueFontMode\": \"default\", \"primaryAlign\": \"right\", \"titlesTextAlign\": \"left\"}, \"adHocDataViews\": {\"metrics-unifi.device-default-ab1efb56f13e258c4741330bf35b2066215bd265307cce933fa6f8589801c6a1\": {\"id\": \"metrics-unifi.device-default-ab1efb56f13e258c4741330bf35b2066215bd265307cce933fa6f8589801c6a1\", \"title\": \"metrics-unifi.device-default\", \"name\": \"metrics-unifi.device-default\", \"sourceFilters\": [], \"fieldFormats\": {}, \"runtimeFieldMap\": {}, \"fieldAttrs\": {}, \"allowNoIndex\": false, \"allowHidden\": false, \"type\": \"esql\"}}, \"query\": {\"esql\": \"FROM metrics-unifi.device-default | WHERE observer.type == \\\"router\\\" | STATS `Up Mbps` = MAX(metrics.unifi.device.speedtest.up_mbps)\"}, \"filters\": []}}}, \"panelIndex\": \"dba2185f-6686-4d10-931f-c4632f4c99a0\", \"gridData\": {\"x\": 8, \"y\": 3, \"w\": 8, \"h\": 5, \"i\": \"dba2185f-6686-4d10-931f-c4632f4c99a0\"}}, {\"type\": \"lens\", \"embeddableConfig\": {\"attributes\": {\"visualizationType\": \"lnsMetric\", \"title\": \"WAN Latency\", \"references\": [], \"state\": {\"datasourceStates\": {\"textBased\": {\"layers\": {\"layer_0\": {\"index\": \"metrics-unifi.device-default-5ee13a47366391e64426b995c1c95df8fc271522cb100f87d95a2cf0fba6bc27\", \"query\": {\"esql\": \"FROM metrics-unifi.device-default | WHERE observer.type == \\\"router\\\" | STATS `Latency ms` = MAX(metrics.unifi.device.uplink.latency_ms)\"}, \"columns\": [{\"columnId\": \"metric_accessor_metric\", \"fieldName\": \"Latency ms\", \"meta\": {\"type\": \"number\"}}]}}}}, \"internalReferences\": [{\"type\": \"index-pattern\", \"id\": \"metrics-unifi.device-default-5ee13a47366391e64426b995c1c95df8fc271522cb100f87d95a2cf0fba6bc27\", \"name\": \"indexpattern-datasource-layer-layer_0\"}], \"visualization\": {\"layerId\": \"layer_0\", \"layerType\": \"data\", \"metricAccessor\": \"metric_accessor_metric\", \"subtitle\": \"\", \"showBar\": false, \"valueFontMode\": \"default\", \"primaryAlign\": \"right\", \"titlesTextAlign\": \"left\"}, \"adHocDataViews\": {\"metrics-unifi.device-default-5ee13a47366391e64426b995c1c95df8fc271522cb100f87d95a2cf0fba6bc27\": {\"id\": \"metrics-unifi.device-default-5ee13a47366391e64426b995c1c95df8fc271522cb100f87d95a2cf0fba6bc27\", \"title\": \"metrics-unifi.device-default\", \"name\": \"metrics-unifi.device-default\", \"sourceFilters\": [], \"fieldFormats\": {}, \"runtimeFieldMap\": {}, \"fieldAttrs\": {}, \"allowNoIndex\": false, \"allowHidden\": false, \"type\": \"esql\"}}, \"query\": {\"esql\": \"FROM metrics-unifi.device-default | WHERE observer.type == \\\"router\\\" | STATS `Latency ms` = MAX(metrics.unifi.device.uplink.latency_ms)\"}, \"filters\": []}}}, \"panelIndex\": \"ceed7d49-177a-41e4-9cea-dcc223572b33\", \"gridData\": {\"x\": 16, \"y\": 3, \"w\": 8, \"h\": 5, \"i\": \"ceed7d49-177a-41e4-9cea-dcc223572b33\"}}, {\"type\": \"lens\", \"embeddableConfig\": {\"attributes\": {\"visualizationType\": \"lnsMetric\", \"title\": \"Packet Loss\", \"references\": [], \"state\": {\"datasourceStates\": {\"textBased\": {\"layers\": {\"layer_0\": {\"index\": \"metrics-unifi.device-default-64d39766a85349e5daa30e0b2d6116264271013687bc76551ece46ab6106fdc8\", \"query\": {\"esql\": \"FROM metrics-unifi.device-default | WHERE observer.type == \\\"router\\\" | STATS `Drops` = MAX(metrics.unifi.device.uplink.drops)\"}, \"columns\": [{\"columnId\": \"metric_accessor_metric\", \"fieldName\": \"Drops\", \"meta\": {\"type\": \"number\"}}]}}}}, \"internalReferences\": [{\"type\": \"index-pattern\", \"id\": \"metrics-unifi.device-default-64d39766a85349e5daa30e0b2d6116264271013687bc76551ece46ab6106fdc8\", \"name\": \"indexpattern-datasource-layer-layer_0\"}], \"visualization\": {\"layerId\": \"layer_0\", \"layerType\": \"data\", \"metricAccessor\": \"metric_accessor_metric\", \"subtitle\": \"\", \"showBar\": false, \"valueFontMode\": \"default\", \"primaryAlign\": \"right\", \"titlesTextAlign\": \"left\"}, \"adHocDataViews\": {\"metrics-unifi.device-default-64d39766a85349e5daa30e0b2d6116264271013687bc76551ece46ab6106fdc8\": {\"id\": \"metrics-unifi.device-default-64d39766a85349e5daa30e0b2d6116264271013687bc76551ece46ab6106fdc8\", \"title\": \"metrics-unifi.device-default\", \"name\": \"metrics-unifi.device-default\", \"sourceFilters\": [], \"fieldFormats\": {}, \"runtimeFieldMap\": {}, \"fieldAttrs\": {}, \"allowNoIndex\": false, \"allowHidden\": false, \"type\": \"esql\"}}, \"query\": {\"esql\": \"FROM metrics-unifi.device-default | WHERE observer.type == \\\"router\\\" | STATS `Drops` = MAX(metrics.unifi.device.uplink.drops)\"}, \"filters\": []}}}, \"panelIndex\": \"e602df52-7c87-4e5e-af16-d81979a08fe4\", \"gridData\": {\"x\": 24, \"y\": 3, \"w\": 8, \"h\": 5, \"i\": \"e602df52-7c87-4e5e-af16-d81979a08fe4\"}}, {\"type\": \"lens\", \"embeddableConfig\": {\"attributes\": {\"visualizationType\": \"lnsMetric\", \"title\": \"Connected Clients\", \"references\": [], \"state\": {\"datasourceStates\": {\"textBased\": {\"layers\": {\"layer_0\": {\"index\": \"metrics-unifi.device-default-bbe12b99ae5cb9a10265b20d3f1bd879d2004a5210362a5ea5770ed99bc7a439\", \"query\": {\"esql\": \"FROM metrics-unifi.device-default | WHERE @timestamp > NOW() - 2 MINUTES | STATS per_device = MAX(metrics.unifi.device.num_clients) BY observer.name | STATS `Clients` = SUM(per_device)\"}, \"columns\": [{\"columnId\": \"metric_accessor_metric\", \"fieldName\": \"Clients\", \"meta\": {\"type\": \"number\"}, \"label\": \"Connected Clients\", \"customLabel\": true}]}}}}, \"internalReferences\": [{\"type\": \"index-pattern\", \"id\": \"metrics-unifi.device-default-bbe12b99ae5cb9a10265b20d3f1bd879d2004a5210362a5ea5770ed99bc7a439\", \"name\": \"indexpattern-datasource-layer-layer_0\"}], \"visualization\": {\"layerId\": \"layer_0\", \"layerType\": \"data\", \"metricAccessor\": \"metric_accessor_metric\", \"subtitle\": \"\", \"showBar\": false, \"valueFontMode\": \"default\", \"primaryAlign\": \"right\", \"titlesTextAlign\": \"left\"}, \"adHocDataViews\": {\"metrics-unifi.device-default-bbe12b99ae5cb9a10265b20d3f1bd879d2004a5210362a5ea5770ed99bc7a439\": {\"id\": \"metrics-unifi.device-default-bbe12b99ae5cb9a10265b20d3f1bd879d2004a5210362a5ea5770ed99bc7a439\", \"title\": \"metrics-unifi.device-default\", \"name\": \"metrics-unifi.device-default\", \"sourceFilters\": [], \"fieldFormats\": {}, \"runtimeFieldMap\": {}, \"fieldAttrs\": {}, \"allowNoIndex\": false, \"allowHidden\": false, \"type\": \"esql\"}}, \"query\": {\"esql\": \"FROM metrics-unifi.device-default | STATS `Clients` = SUM(metrics.unifi.device.num_clients)\"}, \"filters\": []}}}, \"panelIndex\": \"6d495806-28f1-4a09-bfad-cb9997f0bdb2\", \"gridData\": {\"x\": 32, \"y\": 3, \"w\": 8, \"h\": 5, \"i\": \"6d495806-28f1-4a09-bfad-cb9997f0bdb2\"}}, {\"type\": \"lens\", \"embeddableConfig\": {\"attributes\": {\"visualizationType\": \"lnsMetric\", \"title\": \"Online Devices\", \"references\": [], \"state\": {\"datasourceStates\": {\"textBased\": {\"layers\": {\"layer_0\": {\"index\": \"metrics-unifi.device-default-c79743b66e6fde2b42cd509e90b26a70e7906a02eb904cff317a5140b9e0cd42\", \"query\": {\"esql\": \"FROM metrics-unifi.device-default | WHERE metrics.unifi.device.state == 1 | STATS `Online` = COUNT_DISTINCT(observer.name)\"}, \"columns\": [{\"columnId\": \"metric_accessor_metric\", \"fieldName\": \"Online\", \"meta\": {\"type\": \"number\"}}]}}}}, \"internalReferences\": [{\"type\": \"index-pattern\", \"id\": \"metrics-unifi.device-default-c79743b66e6fde2b42cd509e90b26a70e7906a02eb904cff317a5140b9e0cd42\", \"name\": \"indexpattern-datasource-layer-layer_0\"}], \"visualization\": {\"layerId\": \"layer_0\", \"layerType\": \"data\", \"metricAccessor\": \"metric_accessor_metric\", \"subtitle\": \"\", \"showBar\": false, \"valueFontMode\": \"default\", \"primaryAlign\": \"right\", \"titlesTextAlign\": \"left\"}, \"adHocDataViews\": {\"metrics-unifi.device-default-c79743b66e6fde2b42cd509e90b26a70e7906a02eb904cff317a5140b9e0cd42\": {\"id\": \"metrics-unifi.device-default-c79743b66e6fde2b42cd509e90b26a70e7906a02eb904cff317a5140b9e0cd42\", \"title\": \"metrics-unifi.device-default\", \"name\": \"metrics-unifi.device-default\", \"sourceFilters\": [], \"fieldFormats\": {}, \"runtimeFieldMap\": {}, \"fieldAttrs\": {}, \"allowNoIndex\": false, \"allowHidden\": false, \"type\": \"esql\"}}, \"query\": {\"esql\": \"FROM metrics-unifi.device-default | WHERE metrics.unifi.device.state == 1 | STATS `Online` = COUNT_DISTINCT(observer.name)\"}, \"filters\": []}}}, \"panelIndex\": \"24ac03e5-dc9b-455c-a533-76fba01d272e\", \"gridData\": {\"x\": 40, \"y\": 3, \"w\": 8, \"h\": 5, \"i\": \"24ac03e5-dc9b-455c-a533-76fba01d272e\"}}, {\"type\": \"lens\", \"embeddableConfig\": {\"attributes\": {\"visualizationType\": \"lnsXY\", \"title\": \"WAN Throughput\", \"state\": {\"datasourceStates\": {\"textBased\": {\"layers\": {\"area_0\": {\"index\": \"metrics-unifi.device-default-@timestamp\", \"query\": {\"esql\": \"FROM metrics-unifi.device-default | WHERE observer.type == \\\"router\\\" | STATS `TX Mbps` = ROUND(MAX(metrics.unifi.device.uplink.tx_bytes_rate) / 125000.0, 2), `RX Mbps` = ROUND(MAX(metrics.unifi.device.uplink.rx_bytes_rate) / 125000.0, 2) BY bucket = BUCKET(@timestamp, 75, ?_tstart, ?_tend)\"}, \"timeField\": \"@timestamp\", \"columns\": [{\"columnId\": \"area_x\", \"fieldName\": \"bucket\", \"meta\": {\"type\": \"string\"}}, {\"columnId\": \"area_y_0\", \"fieldName\": \"TX Mbps\", \"meta\": {\"type\": \"number\"}, \"label\": \"TX Mbps\", \"customLabel\": true}, {\"columnId\": \"area_y_1\", \"fieldName\": \"RX Mbps\", \"meta\": {\"type\": \"number\"}, \"label\": \"RX Mbps\", \"customLabel\": true}]}}}}, \"internalReferences\": [{\"type\": \"index-pattern\", \"id\": \"metrics-unifi.device-default-@timestamp\", \"name\": \"indexpattern-datasource-layer-area_0\"}], \"visualization\": {\"preferredSeriesType\": \"area\", \"legend\": {\"isVisible\": false, \"shouldTruncate\": false, \"position\": \"right\", \"legendSize\": \"auto\"}, \"layers\": [{\"layerId\": \"area_0\", \"accessors\": [\"area_y_0\", \"area_y_1\"], \"layerType\": \"data\", \"seriesType\": \"area\", \"xAccessor\": \"area_x\"}]}, \"adHocDataViews\": {\"metrics-unifi.device-default-@timestamp\": {\"id\": \"metrics-unifi.device-default-@timestamp\", \"title\": \"metrics-unifi.device-default\", \"name\": \"metrics-unifi.device-default\", \"timeFieldName\": \"@timestamp\", \"sourceFilters\": [], \"fieldFormats\": {}, \"runtimeFieldMap\": {}, \"fieldAttrs\": {}, \"allowNoIndex\": false, \"allowHidden\": false, \"type\": \"esql\"}}, \"query\": {\"esql\": \"FROM metrics-unifi.device-default | WHERE observer.type == \\\"router\\\" | STATS tx = MAX(metrics.unifi.device.uplink.tx_bytes_rate), rx = MAX(metrics.unifi.device.uplink.rx_bytes_rate) BY bucket = BUCKET(@timestamp, 75, ?_tstart, ?_tend)\"}, \"filters\": []}, \"references\": []}}, \"panelIndex\": \"7ec6e4ef-24a7-42b2-8a02-269f3b584cb8\", \"gridData\": {\"x\": 0, \"y\": 8, \"w\": 30, \"h\": 10, \"i\": \"7ec6e4ef-24a7-42b2-8a02-269f3b584cb8\"}}, {\"type\": \"lens\", \"embeddableConfig\": {\"attributes\": {\"visualizationType\": \"lnsXY\", \"title\": \"WAN Latency Over Time\", \"state\": {\"datasourceStates\": {\"textBased\": {\"layers\": {\"line_0\": {\"index\": \"metrics-unifi.device-default-@timestamp\", \"query\": {\"esql\": \"FROM metrics-unifi.device-default | WHERE observer.type == \\\"router\\\" | STATS `Latency ms` = MAX(metrics.unifi.device.uplink.latency_ms) BY bucket = BUCKET(@timestamp, 75, ?_tstart, ?_tend)\"}, \"timeField\": \"@timestamp\", \"columns\": [{\"columnId\": \"line_x\", \"fieldName\": \"bucket\", \"meta\": {\"type\": \"string\"}}, {\"columnId\": \"line_y_0\", \"fieldName\": \"Latency ms\", \"meta\": {\"type\": \"number\"}}]}}}}, \"internalReferences\": [{\"type\": \"index-pattern\", \"id\": \"metrics-unifi.device-default-@timestamp\", \"name\": \"indexpattern-datasource-layer-line_0\"}], \"visualization\": {\"preferredSeriesType\": \"line\", \"legend\": {\"isVisible\": false, \"shouldTruncate\": false, \"position\": \"right\", \"legendSize\": \"auto\"}, \"layers\": [{\"layerId\": \"line_0\", \"accessors\": [\"line_y_0\"], \"layerType\": \"data\", \"seriesType\": \"line\", \"xAccessor\": \"line_x\"}]}, \"adHocDataViews\": {\"metrics-unifi.device-default-@timestamp\": {\"id\": \"metrics-unifi.device-default-@timestamp\", \"title\": \"metrics-unifi.device-default\", \"name\": \"metrics-unifi.device-default\", \"timeFieldName\": \"@timestamp\", \"sourceFilters\": [], \"fieldFormats\": {}, \"runtimeFieldMap\": {}, \"fieldAttrs\": {}, \"allowNoIndex\": false, \"allowHidden\": false, \"type\": \"esql\"}}, \"query\": {\"esql\": \"FROM metrics-unifi.device-default | WHERE observer.type == \\\"router\\\" | STATS `Latency ms` = MAX(metrics.unifi.device.uplink.latency_ms) BY bucket = BUCKET(@timestamp, 75, ?_tstart, ?_tend)\"}, \"filters\": []}, \"references\": []}}, \"panelIndex\": \"b27de81d-4db2-4278-bc1f-48d76192d728\", \"gridData\": {\"x\": 30, \"y\": 8, \"w\": 18, \"h\": 10, \"i\": \"b27de81d-4db2-4278-bc1f-48d76192d728\"}}, {\"type\": \"lens\", \"embeddableConfig\": {\"attributes\": {\"visualizationType\": \"lnsXY\", \"title\": \"Syslog Events by Category\", \"state\": {\"datasourceStates\": {\"textBased\": {\"layers\": {\"bar_stacked_0\": {\"index\": \"logs-unifi.syslog-*-@timestamp\", \"query\": {\"esql\": \"FROM logs-unifi.syslog-* | STATS count = COUNT(*) BY `event.category`, bucket = BUCKET(@timestamp, 75, ?_tstart, ?_tend)\"}, \"timeField\": \"@timestamp\", \"columns\": [{\"columnId\": \"bar_stacked_x\", \"fieldName\": \"bucket\", \"meta\": {\"type\": \"string\"}}, {\"columnId\": \"bar_stacked_y_0\", \"fieldName\": \"count\", \"meta\": {\"type\": \"number\"}}]}}}}, \"internalReferences\": [{\"type\": \"index-pattern\", \"id\": \"logs-unifi.syslog-*-@timestamp\", \"name\": \"indexpattern-datasource-layer-bar_stacked_0\"}], \"visualization\": {\"preferredSeriesType\": \"bar_stacked\", \"legend\": {\"isVisible\": false, \"shouldTruncate\": false, \"position\": \"right\", \"legendSize\": \"auto\"}, \"layers\": [{\"layerId\": \"bar_stacked_0\", \"accessors\": [\"bar_stacked_y_0\"], \"layerType\": \"data\", \"seriesType\": \"bar_stacked\", \"xAccessor\": \"bar_stacked_x\"}]}, \"adHocDataViews\": {\"logs-unifi.syslog-*-@timestamp\": {\"id\": \"logs-unifi.syslog-*-@timestamp\", \"title\": \"logs-unifi.syslog-*\", \"name\": \"logs-unifi.syslog-*\", \"timeFieldName\": \"@timestamp\", \"sourceFilters\": [], \"fieldFormats\": {}, \"runtimeFieldMap\": {}, \"fieldAttrs\": {}, \"allowNoIndex\": false, \"allowHidden\": false, \"type\": \"esql\"}}, \"query\": {\"esql\": \"FROM logs-unifi.syslog-* | STATS count = COUNT(*) BY `event.category`, bucket = BUCKET(@timestamp, 75, ?_tstart, ?_tend)\"}, \"filters\": []}, \"references\": []}}, \"panelIndex\": \"da608fbf-b911-4bf8-b6af-457073fdef8d\", \"gridData\": {\"x\": 0, \"y\": 18, \"w\": 24, \"h\": 8, \"i\": \"da608fbf-b911-4bf8-b6af-457073fdef8d\"}}, {\"type\": \"lens\", \"embeddableConfig\": {\"attributes\": {\"visualizationType\": \"lnsXY\", \"title\": \"Top Event Processes\", \"state\": {\"datasourceStates\": {\"textBased\": {\"layers\": {\"bar_horizontal_0\": {\"index\": \"logs-unifi.syslog-*-b23c1fea34160c13fd89d41ea2e38d8d9299b4741ab54c8c92001231f2c28947\", \"query\": {\"esql\": \"FROM logs-unifi.syslog-* | STATS count = COUNT(*) BY `process.name` | SORT count DESC | LIMIT 10\"}, \"columns\": [{\"columnId\": \"bar_horizontal_x\", \"fieldName\": \"process.name\", \"meta\": {\"type\": \"string\"}}, {\"columnId\": \"bar_horizontal_y_0\", \"fieldName\": \"count\", \"meta\": {\"type\": \"number\"}}]}}}}, \"internalReferences\": [{\"type\": \"index-pattern\", \"id\": \"logs-unifi.syslog-*-b23c1fea34160c13fd89d41ea2e38d8d9299b4741ab54c8c92001231f2c28947\", \"name\": \"indexpattern-datasource-layer-bar_horizontal_0\"}], \"visualization\": {\"preferredSeriesType\": \"bar_horizontal\", \"legend\": {\"isVisible\": false, \"shouldTruncate\": false, \"position\": \"right\", \"legendSize\": \"auto\"}, \"layers\": [{\"layerId\": \"bar_horizontal_0\", \"accessors\": [\"bar_horizontal_y_0\"], \"layerType\": \"data\", \"seriesType\": \"bar_horizontal\", \"xAccessor\": \"bar_horizontal_x\"}]}, \"adHocDataViews\": {\"logs-unifi.syslog-*-b23c1fea34160c13fd89d41ea2e38d8d9299b4741ab54c8c92001231f2c28947\": {\"id\": \"logs-unifi.syslog-*-b23c1fea34160c13fd89d41ea2e38d8d9299b4741ab54c8c92001231f2c28947\", \"title\": \"logs-unifi.syslog-*\", \"name\": \"logs-unifi.syslog-*\", \"sourceFilters\": [], \"fieldFormats\": {}, \"runtimeFieldMap\": {}, \"fieldAttrs\": {}, \"allowNoIndex\": false, \"allowHidden\": false, \"type\": \"esql\"}}, \"query\": {\"esql\": \"FROM logs-unifi.syslog-* | STATS count = COUNT(*) BY `process.name` | SORT count DESC | LIMIT 10\"}, \"filters\": []}, \"references\": []}}, \"panelIndex\": \"7e39759b-b871-42a7-a747-77e13df75e06\", \"gridData\": {\"x\": 24, \"y\": 18, \"w\": 24, \"h\": 8, \"i\": \"7e39759b-b871-42a7-a747-77e13df75e06\"}}]",
    "pinned_panels": {
      "panels": {}
    },
    "timeFrom": "now-24h",
    "timeRestore": true,
    "timeTo": "now",
    "title": "UniFi Overview"
  },
  "coreMigrationVersion": "8.8.0",
  "created_at": "2026-03-24T18:07:08.197Z",
  "id": "unifi-overview-dashboard",
  "managed": false,
  "references": [],
  "type": "dashboard",
  "typeMigrationVersion": "10.3.0",
  "updated_at": "2026-03-24T18:07:08.197Z",
  "version": "WzMxMDQsMV0="
}